## 262. Trips and Users (Hard)

In [ ]:
Write a SQL query to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) each day between "2013-10-01" and "2013-10-03".

The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users by the total number of requests with unbanned users on that day.

Return the result table in any order. Round Cancellation Rate to two decimal points.

The query result format is in the following example:
    
    Table: Trips

+-------------+----------+
| Column Name | Type     |
+-------------+----------+
| Id          | int      |
| Client_Id   | int      |
| Driver_Id   | int      |
| City_Id     | int      |
| Status      | enum     |
| Request_at  | date     |     
+-------------+----------+

Id is the primary key for this table.
The table holds all taxi trips. Each trip has a unique Id, while Client_Id and Driver_Id are foreign keys to the Users_Id at the Users table.
Status is an ENUM type of (‘completed’, ‘cancelled_by_driver’, ‘cancelled_by_client’).

    Table: Users
+-------------+----------+
| Column Name | Type     |
+-------------+----------+
| Users_Id    | int      |
| Banned      | enum     |
| Role        | enum     |
+-------------+----------+

Users_Id is the primary key for this table.
The table holds all users. Each user has a unique Users_Id, and Role is an ENUM type of (‘client’, ‘driver’, ‘partner’).
Status is an ENUM type of (‘Yes’, ‘No’).

In [4]:
'''WITH CTE AS (SELECT * FROM trips
             WHERE client_id IN (SELECT users_id
                                 FROM users 
                                 WHERE banned = 'No')
             AND driver_id IN (SELECT users_id
                               FROM users 
                               WHERE banned = 'No')
             AND request_at BETWEEN '2013-10-01' and '2013-10-03')
 
 
 SELECT request_at AS 'Day', 
        ROUND(CAST(SUM(CASE 
                    WHEN status = 'completed'
                    THEN 0 
                    ELSE 1 
                  END) AS DECIMAL(18,2)) / 
              COUNT(*), 2)
             AS 'Cancellation Rate'
 FROM CTE
 GROUP BY request_at;'''

"WITH CTE AS (SELECT * FROM trips\n             WHERE client_id IN (SELECT users_id\n                                 FROM users \n                                 WHERE banned = 'No')\n             AND driver_id IN (SELECT users_id\n                               FROM users \n                               WHERE banned = 'No')\n             AND request_at BETWEEN '2013-10-01' and '2013-10-03')\n \n \n SELECT request_at AS 'Day', \n        ROUND(CAST(SUM(CASE \n                    WHEN status = 'completed'\n                    THEN 0 \n                    ELSE 1 \n                  END) AS DECIMAL(18,2)) / \n              COUNT(*), 2)\n             AS 'Cancellation Rate'\n FROM CTE\n GROUP BY request_at;"

## 601. Human Traffic of Stadium

In [4]:
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| visit_date    | date    |
| people        | int     |
+---------------+---------+
visit_date is the primary key for this table.
Each row of this table contains the visit date and visit id to the stadium with the number of people during the visit.
No two rows will have the same visit_date, and as the id increases, the dates increase as well.
 

Write an SQL query to display the records with three or more rows with consecutive id's, and the number of people is greater than or equal to 100 for each.

Return the result table ordered by visit_date in ascending order.

The query result format is in the following example.

 

Stadium table:
+------+------------+-----------+
| id   | visit_date | people    |
+------+------------+-----------+
| 1    | 2017-01-01 | 10        |
| 2    | 2017-01-02 | 109       |
| 3    | 2017-01-03 | 150       |
| 4    | 2017-01-04 | 99        |
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-09 | 188       |
+------+------------+-----------+

Result table:
+------+------------+-----------+
| id   | visit_date | people    |
+------+------------+-----------+
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-09 | 188       |
+------+------------+-----------+
The four rows with ids 5, 6, 7, and 8 have consecutive ids and each of them has >= 100 people attended. Note that row 8 was included even though the visit_date was not the next day after row 7.
The rows with ids 2 and 3 are not included because we need at least three consecutive ids.

SyntaxError: invalid syntax (<ipython-input-4-efbf3a03c004>, line 1)

In [3]:
# Write your T-SQL query statement below

"""WITH CTE1 AS (
    SELECT 
        (id - RANK() OVER (ORDER BY id)) as [pointer], -- same number for consecutive ids
        id,
        visit_date,
        people
    FROM Stadium
    WHERE people > 99
),
    CTE2 AS (
    SELECT 
        COUNT(id) OVER (PARTITION BY [pointer]) as [three_or_more], -- count number of consecutive ids
        id,
        visit_date,
        people
    FROM CTE1
)

SELECT
    id, visit_date, people
FROM CTE2 WHERE [three_or_more] > 2"""

'WITH CTE1 AS (\n    SELECT \n        (id - RANK() OVER (ORDER BY id)) as [pointer],\n        id,\n        visit_date,\n        people\n    FROM Stadium\n    WHERE people > 99\n),\n    CTE2 AS (\n    SELECT \n        COUNT(id) OVER (PARTITION BY [pointer]) as [three_or_more],\n        id,\n        visit_date,\n        people\n    FROM CTE1\n)\n\nSELECT\n    id, visit_date, people\nFROM CTE2 WHERE [three_or_more] > 2'

## 185. Department Top Three Salaries

In [ ]:
The Employee table holds all employees. Every employee has an Id, and there is also a column for the department Id.

+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
| 7  | Will  | 70000  | 1            |
+----+-------+--------+--------------+
The Department table holds all departments of the company.

+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
Write a SQL query to find employees who earn the top three salaries in each of the department. For the above tables, your SQL query should return the following rows (order of rows does not matter).

+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| IT         | Randy    | 85000  |
| IT         | Joe      | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |
+------------+----------+--------+
Explanation:

In IT department, Max earns the highest salary, both Randy and Joe earn the second highest salary, and Will earns the third highest salary. There are only two employees in the Sales department, Henry earns the highest salary while Sam earns the second highest salary.